{
    "Candidate": {
        "Name": "Tony Calice",
        "Online Resume/Portfolio": "https://www.foreveryidea.com/",
        "Summary": "I use web technology to describe technology objectives/capabilities"
    },
    "Project Experience": {
        "April 2025 to August 2025: Health Care Service Corporation": {
            "Project": "IL Medicaid Government Services Healthcare Payer Platform Migration",
            "Organization": "HCSC Trexin Resource",
            "Job Title": "Product Owner",
            "Functional Reporting Area": "Medicaid and Government Platforms Technology Delivery",
            "Organizational Primary Focus": "Medicaid Gold Carding Project/Medicaid Migration/Interoperability and Prior Authorization",
            "Approach/Methodology": "Hybrid Delivery",
            "Project Team Size": "10-15",
            "Budget": "5-10 Million",
            "Project Dates": "April 2025 to August 2025",
            "Project Description": "Led product strategy and delivery for Medicaid interoperability and prior authorization modernization. Defined user stories and acceptance criteria to support gold carding initiatives aligned with Illinois Public Act 103-0593. Collaborated with cross-functional teams to implement FHIR-based APIs and streamline utilization management workflows. Ensured compliance with CMS mandates and drove stakeholder alignment across government platforms.",
            "PMI Project Description": "Developed a high-level product roadmap with business and system milestones.  Consulted with senior management on the key delivery dates delivery dates. Prepared product roadmap to visualize release plans for mandated functionality and system migration milestones. Collaborated with team resouces in daily standup meetins to review status of current sprint, identify critical path dependencies, and monitor sprint monitor velocity. Supported project monitoring activities with baseline estimates, product burndown charts, and inputs for ongoing portfolio performance analysis. "
        },
        "March 2024 - October 2024: GuidingCare ": {
            "Project": "Healthcare Benefits Utilization Management Solution Implementation",
            "Organization": "HealthEdge",
            "Job Title": "Data Integration Analyst",
            "Functional Reporting Area": "Data Integration",
            "Organizational Primary Focus": "Data Migraiton and Operational Interfaces",
            "Approach/Methodology": "Hybrid Delivery",
            "Project Team Size": "5-9",
            "Budget": "1-5 Million",
            "Project Dates": "March 2024 to October 2024",
            "Project Description": "Designed and validated data integration workflows for MetroPlus product launch. Mapped source-to-target specifications and supported ETL development for operational interfaces. Facilitated agile ceremonies and collaborated with QA teams to ensure data accuracy and integrity across payer systems. Enabled seamless onboarding of new product lines through scalable data migration strategies.",
            "PMI Project Description": "Developed work breakdown structure from a list of data integration objectives that were a New York City healthcare payer needed to implement a target state utilization management platform. Iteratively facilitated \"deep dive\" walkthroughs of each item listed in the WBS with business and system stakeholders and identify any variance between baseline requirements and leadership expectations. Collaborated with team members in daily standup to ensure that meeting outcomes were appropriately represented in current state work products, change request, and risk register. Scheduled WBS items (that met the definition of ready) into sprints that would ensure delivery ahead of key project milestones."
        },
        "4ei Launch Adventure Stickers Product - January 2024 - December 2025": {
            "Project": "Bystander Emergency Portal",
            "Organization": "For Every Idea LLC",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Ownership",
            "Organizational Primary Focus": "Product Development",
            "Approach/Methodology": "Adaptive Delivery",
            "Project Team Size": "2",
            "Budget": "200k",
            "Project Dates": "January 1, 2024 to December 1, 2025",
            "Project Description": "Designed and launched a QR-based emergency alert system enabling bystanders to notify emergency contacts via mobile scan. Defined user stories, orchestrated agile sprints, and validated accessibility and usability. Delivered scalable MVP under $1M budget, integrating low-code automation and real-time notification workflows",
            "PMI Project Description": "Reused organizational assets from a 2016 project to accelerate the launch of a new product for professional and private excursions that enables bystaders to notify trusted peers in case of emergency. Planned the procurement of critical path resources to compress scheduled development of web-based portal and mobile app. Authorred quality management plan to mitigate risk of AI authored C# code with industry standard API conformance tests for security, reliability, and updateability. Decomposed high-level project scope into Epics Stories and Features that can be incrementally delivered as time permits."
        },
        "Mar 2022 to Dec 2022: Arizona BlueCross": {
            "Project": "BlueCross (Velocity Connect) Membership Platform - Beneficiary API Services",
            "Organization": "Arizona BlueCross",
            "Job Title": "Technical Solution Analyst",
            "Functional Reporting Area": "Velocity Connect Platform",
            "Organizational Primary Focus": "Microservice Solution Delivery",
            "Approach/Methodology": "Adaptive Delivery",
            "Project Team Size": "5-9",
            "Budget": "1M - 5M",
            "Project Dates": "March 1, 2022 to December 1, 2022",
            "Project Description": "Led requirements traceability for a $1–5M modernization initiative on the Velocity Connect platform. Developed and maintained RTMs to ensure alignment across design, development, and testing phases. Conducted impact analyses and resolved gaps in stakeholder requirements. Automated traceability workflows to improve delivery efficiency and compliance with agile standards",
            "PMI Project Description": "Consulted with senior management on critical path governance requirements to ensure the enforcement of technical safeguard on protected health information. Collaborated with team resources in daily standup meetings to review assigned \"Source to Target Mapping\" stories to review previous days progress in completing STTM assignments and highlight any obstacles.  Continuously documented lessoned regarding automated (Postman) conformance testing plans, open Application Program Interface (web api) requirement specifications, and how to validate secured data endpoints with Open Authentication (oAuthb 2.0) security tokens. Mentored senior leadership on the traceability capabilities in the Azure DevOps PMIS system that provided metrics on each of the assigned SSTM work products. Advised leadership on how these metrics could be used to quantity relative complexity, quality, and resource effort required to deliver any given API endpoint. Confronted problems (resulting from complex work packages) collaboratively among team members in order to ensure that assigned STTM work package satisfied the PMO (Data) Governance and development team's API development team's definition of ready. Documented reusable lessons learned in the enterprise knowledge management system."
        },
        "4ei Launch Digital Storefront January 2021 - December 2021": {
            "Project": "Digital Storefront MVP",
            "Organization": "For Every Idea LLC",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Ownership",
            "Organizational Primary Focus": "Customer Service",
            "Approach/Methodology": "Adaptive Delivery",
            "Project Team Size": "2",
            "Budget": "200 k",
            "Project Dates": "January 1, 2021 to December 1, 2021",
            "Project Description": "Developed MVP for a digital customer portal offering on-demand illustration and transcription services. Defined functional requirements, user flows, and accessibility standards. Conducted usability testing and refined UI/UX based on feedback. Enabled scalable service delivery through low-code platform integration and automated order processing.",
            "PMI Project Description": "Initiated project charter from reusable company \"Digital Enterprise\" and defined high-level requirements to reduce the critical path of new customer acquisition from days to minutes. Authored quality management plan that incorporated External Environmental Factors (such as Payer Card Industry Standards and web security) to mitigate the risk of unsecured financial information. Defined product costs and online delivery method for made-to-order digital illustration, transcription, and streaming video increments. Successfully closed project ahead of schedule with a successfully demonstrated Digital Storefront order for made-to-order digital art and video increment that was entirely ordered and fulfilled from the For Every Idea Digital Storefront. https://www.foreveryidea.com/finetuned.html"
        },
        "4ei MVP virtual business operations 2019 - October 2020": {
            "Project": "Digital Enterprise",
            "Organization": "For Every Idea LLC",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Ownership",
            "Organizational Primary Focus": "Company Operations",
            "Approach/Methodology": "Adaptive Delivery",
            "Project Team Size": "2",
            "Budget": "200k",
            "Project Dates": "January 1, 2019 to October 1, 2020",
            "Project Description": "Developed Project Charter and Identified stakeholders needed for implementing a digital workflows for industry standard business banking and financial tasks. Prepared procurement plan for aquiring and configuring low-code technology needed to perform sophisticate back-office support tasks for small business clients.",
            "PMI Project Description": "Developed Project Charter and Identified stakeholders needed for implementing a digital workflow for industry standard business banking and financial tasks. Prepared procurement plan that was successful in acquiring and configuring low-code technology that performs critical path back-office support tasks in seconds. Planned electronic communication channels for back-office solution to automate feedback activities and mitigate risk of human error/delays. Successfully closed project ahead of schedule and under budget with a deployed an online solution that integrates accounts receivable email, banking, invoicing, and client portal technologies. Produced organization job aid and using solution to expedite new client (Time and Materials) contracts, invoice generation, financial reports, and industry standard payment preferences."
        },
        "June 2014 - May 2020: Centers for Medicare and Medicaid Service": {
            "Project": "New Medicare Card Project",
            "Organization": "Centers for Medicare and Medicaid Services",
            "Job Title": "Enterprise Architect",
            "Functional Reporting Area": "Office of Information Technology",
            "Organizational Primary Focus": "Public Healthcare Payer",
            "Approach/Methodology": "Predictive",
            "Project Team Size": "21+",
            "Budget": "25M or More",
            "Project Dates": "June 1, 2014 to May 1, 2020",
            "Project Description": "Architected enterprise solutions for CMS’s $25M+ initiative to replace SSN-based identifiers with randomized MBIs for 60M beneficiaries. Integrated SSA data interfaces, validated continuity across 95 federal systems, and supported ADA-compliant web design. Led cross-team coordination for timely deployment of capabilities impacting national healthcare payments and delivery.",
            "PMI Project Description": "Executed project management responsibilities for Centers for Medicare and Medicaid New Medicare Card Project to reissue new Medicare identifiers to 60 Millions beneficiaries. Identified risk of implementing target state New Medicare Card Functionality with business and system owners with by facilitating table top (virtual) walkthrough of target state project requirements. Monitored New Medicare Card fulfillment risk (namely out of date mailing addresses) and provided input that ultimately led to the succesful project closing."
        },
        "Jan 2008 to Dec 2008: BlueCross BlueShield of Michigan": {
            "Project": "Small Group Enrollment",
            "Organization": "Blue Cross Blue Shield of Michigan",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Office of Information Technology",
            "Organizational Primary Focus": "Private Healthcare Payer",
            "Approach/Methodology": "Predictive Solution Delivery",
            "Project Team Size": "5-9",
            "Budget": "1-5 Million",
            "Project Dates": "January 1, 2008 to December 1, 2008",
            "Project Description": "Delivered cross-functional COTS solution with complex data integration. Managed requirements, risk, and change deliverables. Facilitated stakeholder alignment and ensured compliance with agile delivery standards.",
            "PMI Project Description": "Supported project managment planning efforts to deliver a cross-functional (commercial-off-the-shelf) solution for Blue Cross PPO and HMO lines of business with with specific business requirements that meaningfully conformed to BCBS Rational Unified Solution (RUP) architecture IT governance standards. Faciltated requirement validation among business and system stakeholders identified in team charter. Managed summer intern resource."
        },
        "2007 Aug to Jan 2008: Comerica Bank": {
            "Project": "Web Hosting Converstion",
            "Organization": "Comerica Bank",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Emerging Technologies and Payment Services",
            "Organizational Primary Focus": "Web Based Technology",
            "Approach/Methodology": "Agile Delivery",
            "Project Team Size": "3-5",
            "Budget": "Less than 1 Milliion",
            "Project Dates": "August 1, 2007 to January 1, 2008",
            "Project Description": "Migrated legacy web hosting infrastructure to modern platforms. Defined technical requirements, coordinated vendor solutions, and ensured secure transition of payment services. Supported agile delivery and stakeholder engagement."
        },
        "2005 Nov to June 2006: ABN AMRO": {
            "Project": "IBM Quickplace Knowledge Managment Solution",
            "Organization": "ABN AMRO",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Back Office Retail Mortgage Origination",
            "Organizational Primary Focus": "Consumer Mortgage Origination",
            "Approach/Methodology": "Agile Delivery",
            "Project Team Size": "3-5",
            "Budget": "Less than 1 Millon",
            "Project Dates": "November 1, 2005 to June 1, 2006",
            "Project Description": "Developed documentation suite including project plans, WBS, test scripts, and training materials for Quickplace rollout. Facilitated stakeholder workshops and ensured alignment with back-office mortgage origination workflows"
        },
        "2005 Sept to March 2006: ABN AMRO": {
            "Project": "DAC Workflow Reporting Solution",
            "Organization": "ABN AMRO",
            "Job Title": "Business Analyst",
            "Functional Reporting Area": "Back Office Retail Mortgage Origination",
            "Organizational Primary Focus": "Consumer Mortgage Origination",
            "Approach/Methodology": "Agile Delivery",
            "Project Team Size": "3-5",
            "Budget": "Less than $1Million",
            "Project Dates": "September 1, 2005 to March 1, 2006",
            "Project Description": "Defined KPIs and authored software and business requirements for DAC reporting system. Enabled visibility into mortgage origination workflows and supported agile delivery of analytics capabilities."
        },
        "2002 Jan to 2002 Aug: Macomb County Michigan Circuit Court": {
            "Project": "Court Docket Managemnt System",
            "Organization": "Macomb County Michigan Circuit Court",
            "Job Title": "Sr Business Analyst",
            "Functional Reporting Area": "Office of Information Technology",
            "Organizational Primary Focus": "Family Court",
            "Approach/Methodology": "Agile Delivery",
            "Project Team Size": "5-9",
            "Budget": "1-5 Million",
            "Project Dates": "January 1, 2002 to August 1, 2002",
            "Project Description": "Designed web-based docket system to improve communication among courts, probation officers, and juvenile case workers. Led scope redefinition and change management activities. Delivered agile solution enhancing operational transparency and coordination."
        }
    },
    "Solution Visualization Technologies": {
        "For Executive Presentations": {
            "#text": "ecommerce prototype of a PCI Compliant capability",
            "Description": "off-the-shelf ecommerce microservice payment integration",
            "Portfolio prototype example": "example cloud platform solution",
            "Web link": "https://www.foreveryidea.com/services.html"
        },
        "Specific Information Requirements": {
            "machine readable": "information models, web interfaces, other reusable standards",
            "human understandable": "web accessibility standards, user navigation, technical writing"
        }
    },
    "Office 365 - Attachments": {"Calice.resume.LIVE.technologypracticioner": "https://foreveryidea-my.sharepoint.com/:w:/p/tony/EcdmtFJQ5_VOmrCaGhPlR1YBuC0Z-LtkRcAGUP_VHX6JzA?e=oKd7PG"}
}